# 时间：2023/5/29 18:32
# 人员: 莉光哈哈哈
print("算术运算符")
print(1+1) # 加法运算
print(1-1) # 减法运算
print(2*4) # 乘法运算
print(1/2) # 除法运算
print(11//2) # 整除运算
print(11%2) # 取余运算
print(3**2) #幂运算

print("--------------------------------------------")
print(9//4)
print(-9//-4)
# 向下取整数
print(9//-4)
print(-9//4)
print("--------------------------------------------")

print (9%-4) # -3 公式 余数=被除数-除数*商
print (-9%4)
print("--------------------------------------------")

print("赋值运算符")
a=b=c=30
print(a,id(a))
print(b,id(b))
print(c,id(c))
print("--------------------------------------------")
#参数赋值
a=30
a+=30  #相当于a=a+30
print(a)
a-=30  #相当于a=a-30
print(a)
a*=30  #相当于a=a*30
print(a)
a/=40  #相当于a=a/45
print(a,type(a))
a//=2
print(a)
a%=3
print(a)
print("--------------------------------------------")


#支持系列解包赋值
a,b,c=10,20,30
print(a,b,c)


print("比较运算符")#比较结果为bool类型：true  or  false
print("--------------------------------------------")

