# 时间：2023/5/29 15:02
# 人员: 莉光哈哈哈
#1.输出数字
print(666)
print(99.9)
print("--------------------------------------------")


#2.输出字符串
print("hello world")
print('hello python')
print("--------------------------------------------")


#3.输出含有运算符的表达式
print(3+1)
print("--------------------------------------------")


#4.将数据输出文件中:
#注意点：所指定的盘存在、使用file=fp
fp=open('D:/text.txt','a+')#  a+表示如果文件内容不存在就创建，存在就在文件内容的后面继续追加
print('hello world',file=fp)
fp.close()



#5.不进行换行输出（输出内容在一行当中）
print("hello","world","python")
print("--------------------------------------------")


#6.转义字符
print("hello\nworld")#  \ +转义功能的首字母 n-->newline的首字母表示换行
print("--------------------------------------------")


print("hello\tworld")
print("helloooo\tworld")#  \t占4个制表位
print("--------------------------------------------")


print("hello\rworld")#   \r表示回车
print("--------------------------------------------")


print("hello\bworld")#   \b表示退格，将o退没了
print("--------------------------------------------")


print("http:\\\\www.baidu.com")
print("老师说:\'大家好\'")
print("--------------------------------------------")


#原字符，不希望字符串中的转义字符起作用，就是用原字符，就是在字符串之前加上r或R
print(r"hello\nworld")